// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.

System.Console.WriteLine("Введите количество строк массива m:");
int m = Int32.Parse(System.Console.ReadLine());
System.Console.WriteLine("Введите количество столбцов массива n:");
int n = Int32.Parse(System.Console.ReadLine());
int[,] matrix = new int[m, n];
for (int i = 0; i < matrix.GetLength(0); i++)
{
    for (int j = 0; j < matrix.GetLength(1); j++)
    {
        matrix[i, j] = new Random().Next(0, 10);
        Console.Write((matrix[i, j] + "\t"), 4);
    }
    System.Console.WriteLine();
}
System.Console.WriteLine();
double average = 0;
for (int j = 0; j < matrix.GetLength(1); j++)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
    average = average + matrix [i,j];
    }
    System.Console.WriteLine($"Среднее значение столбца {j+1} равно {Math.Round(average / (m),1)} ");
    average = 0;
}
